tests/performance/data_masking/data_masking_load_test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable

  target: https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/singleton128
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/singleton128"
        - get:
            url: "https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/singleton1024"
        - get:
            url: "https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/singleton1769"
        - get:
            url: "https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/nonsingleton128"
        - get:
            url: "https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/nonsingleton1024"
        - get:
            url: "https://sebwc2y7gh.execute-api.us-west-2.amazonaws.com/Prod/nonsingleton1769"
        count: 100